[
  {
    "id": "about-me",
    "heading": "Milen Georgiev",
    "secondaryHeading": "\"Never give up on a dream just because of the time it will take to accomplish it. The time will pass anyway.\" &mdash; <strong>Earl Nightingale</strong>",
    "description": "<p>Currently, I am studying <strong>Computer Science</strong> in <em>University of Surrey</em> (second year). Before that I was an intern Software Developer at <em>Tehnologica Ltd.</em>, where I gained invaluable experience in the sphere of programming, having participated in several team projects (for <strong>NATO</strong> and <strong>Bulgarian Gov.</strong>).</p><p>As far as my interests are concerned, <em>Mathematics</em> has always been my favourite science, because I reckon that it is in the base of everything &mdash; not only in algorithms, data-structures, modelling and simulations, but also it is an irreplaceable part even in our everyday lives. Therefore, I consider that being a capable software engineer is not possible without a great deal of mathematical knowledge. Moreover, as I had a conditional offer from <strong>University of Cambridge</strong> to study Mathematics (after 2 interviews and 2 tests there) and always try to expand my mathematical capabilities, I believe that I will have the opportunity to bloom in the sphere of <em>Computer Science</em>.</p><p>On the other hand, my other main interest is <em>Software Developing</em>. It all started in the 5th grade when I started attending extracurricular activities at my school, where we created simple console applications in C++, in order to develop our algorithmic thinking. I decided I want programming to be my future. Consequently, I learned a lot from these activities, Informatics classes at school (6+ hour/week), in <em>University of Surrey</em>, work and mostly from information online (primarily from <em>SoftUni</em>, <em>Telerik Academy</em>, <em>YouTube</em> etc.). Now I have deep understanding in the science:</p><ul class=\"font-italic\"><li>.NET (Frameworks and Core): C#, EF, ASP.NET, WPF</li><li>C/C++</li><li>Java, MySQL, Swing</li><li>SQL Server, T-SQL</li><li>HTML/CSS, JavaScript, Bootstrap</li><li>JSON, XML</li><li>OOP, High-Quality Code, UML, Asynchronous code and Multi-threading, Data Structures and Algorithm</li><li>Arduino Uno (C/AVR Assembly)</li><li>Android: Activities, Layouts, SQL-Lite, Multi-threading</li></ul><p>I have participated in several projects in a team and myself. What I want is to heap more <em>knowledge and experience</em>.</p>",
    "picture": {
      "width": 100,
      "source": "media/earl-nightingale.jpg",
      "link": "https://en.wikipedia.org/wiki/Earl_Nightingale",
      "alternative": "earl-nightingale.jpg",
      "isRounded": false
    }
  }
]