[
  {
    "id": "surrey",
    "heading": "University of Surrey",
    "secondaryHeading": "BSc (Hons) with Year in Industry &mdash; Oct 2018 &ndash; 2022",
    "description": "<p>I am studying <strong>BSc (Hons) Computer Science</strong> <em>second year (sandwich course)</em> in <strong>University of Surrey</strong> where I am improving and affirming my knowledge in <em>Software Engineering</em>. The third year of my course is <em>industrial placement</em>. <strong>I won <em>Consult Hyperion Prize for Best Student Performance</em> in the 1st Year of the BSc in Computer Science.</strong></p><br /><h4 class=\"text-center font-italic\">First Year (90.5% score with <em>Best Performance Award</em>)</h4><p>1st Semester: (91% - First among 200 students in BSc Computer Science)</p><ul class=\"font-italic\"><li><strong>Programming Fundamentals (94%):</strong> the basis of software developing; object-oriented programming; Java; Unit testing with JUnit</li><li><strong>Web and Database Systems (88%):</strong> Computer Networking: Web, URL, relative and absolute paths, HTTP requests, Cookies, Web Security, HTML, CSS, PHP, JavaScript (jQuery), data objects transmission formats &ndash; XML and JSON, Databases &ndash; MySQL</li><li><strong>Computer Logic (87%):</strong> how a computer works at the lowest levels, logic gates, truth tables, combinational circuits, adders, latches and flip-flops, number bases, Arduino: AVR Assembly, C programming language</li><li><strong>Foundations of Computing (93%):</strong> Set Theory, Number theory, base functions theory, Logic</li></ul><p>2nd Semester (90% - First among 200 students in BSc Computer Science):</p><ul class=\"font-italic\"><li><strong>Software Engineering (85%):</strong> designing &ndash; UML, Software Requirements Specification, test planning; implementing and testing (unit testing and requirements testing) desktop software systems (Java, Swing &ndash; WindowBuilderPro, JUnit)</li><li><strong>Mobile Computing (79%):</strong> operating systems basis &ndash; bootloader, terminals, multi-threading, thread pool; Android: adb and fastboot, applications &ndash; Layouts, Activities, SQLite and multi-threading (Java was used)</li><li><strong>Data Structures and Algorithms (98%):</strong> algorithm analysis (Big O, Big Omega, Big Theta, Little o notation), recursion, sorting &ndash; Bubble, Insertion, Heap, Quick, Merge, Radix; graph algorithms and complex data structures &ndash; stacks and queues, linked lists, Binary trees, heaps</li><li><strong>Foundations of Computing II (99%):</strong> Calculus &ndash; limits, continuity, derivatives, integration and applications</li></ul><br /><h4 class=\"text-center font-italic\">Second Year</h4><p>1st Semester:</p><ul class=\"font-italic\"><li><strong>Advanced Algorithms (94%):</strong> algorithmic techniques for various sets of problems: Divide-and-Conquer; Greedy Approaches; Dynamic Programming; Network Flow Algorithms; NP problems etc.</li><li><strong>Further Programming Paradigms (85%):</strong> programming paradigms with both theoretical and practical aspects - Object-Oriented Programming (with C++); Functional Programming (with Haskell); Logic Programming (with Prolog); other programming concepts - type safety; compiler; interpreter; Abstract Machine etc. </li><li><strong>Information Retrieval (71%):</strong> Notions of structured, unstructured and semi-structured data; Crawlers, stopwords and keywords, indexing and stemming; Boolean retrieval, ranked retrieval, and vector spaces; precision and recall; data normalization and de-normalization</strong></li><li><strong>Web Application Development (92%):</strong> Building interactive web applications using Ruby and Ruby on Rails: MVC Pattern; Routing; Object-relational mapping; RESTful Architectures; </li></ul><p>2nd Semester (grades are not part of final result due to COVID-19 No-Detriment Policy):</p><ul class=\"font-italic\"><li><strong>Artificial Intelligence (79%):</strong> Introduction to Machine Learning, KNN, Multilayer Perceptron and Convolutional Neural Networks, Support Vector Machines, Bayesian Classifiers</li><li><strong>Computer Networking (75%):</strong> Layers and Protocols (Application, Transport, Network, Link/Physical), TCP, UDP, Network Security - Methods, Vulnerabilities and uses of Encryption</li><li><strong>Parallel Computing:</strong> Control Structure, Communication Model, Physical Organisation, Principles of Parallel Algorithm Design, Nvidia CUDA C</li><li><strong>Software Engineering Project (74%):</strong> Project management in all phases - from Initial Requirements, Planning to Development and Testing, Teamwork, Design Thinking, Software design and specification, Quality Assurance</li></ul>",
    "picture": {
      "width": 300,
      "source": "/svg/university-of-surrey.svg",
      "link": "https://www.surrey.ac.uk/",
      "alternative": "University of Surrey Logo",
      "isRounded": true
    }
  },
  {
    "id": "sofia-high-school",
    "heading": "Sofia High School of Mathematics",
    "secondaryHeading": "High School Education &mdash; 2010 &ndash; 2018",
    "description": "<p>I studied in Sofia High School of Mathematics (SHSM) from 2010 to 2018. It is considered to be the best secondary school in Bulgaria, especially for <strong>Mathematics and Computer Science</strong>, and is the hardest one to get admitted to. The students of SHSM are globally known for their achievements not only for <em>Mathematics and Computer Science</em>, but also for <strong>natural sciences</strong> such as <em>Physics</em>, <em>Chemistry</em>, <em>Astronomy</em> etc.</p><p>My high school was the place I found my passion for creating software as there I started attending <strong>extracurricular classes for programming</strong> in the 6th grade. In these classes we used to construct simple console applications in <strong>C++</strong> in order to develop our <em>algorithmic thinking</em>. Eventually, we had 6+ hours a week <strong>Programming classes</strong>, in which we studied the basis of <em>object-oriented programming</em> and <em>high-quality code</em>.</p><p>At Sofia High School of Mathematics I obtained a Diploma za Zavarsheno Sredno Obrazovanie with an <strong>Overall Score: Excellent 5.96/6.00</strong></p><p>The scores of my <em>state matriculation exams</em> were as follows:</p><ul class=\"font-italic\"><li>Physics and Astronomy: Excellent 6.00/6.00</li><li>Mathematics: Excellent 6.00/6.00</li><li>Bulgarian Language and Literature: Excellent 5.64/6.00 (the only grade different from 6.00 in my whole diploma)</li></ul",
    "picture": {
      "width": 300,
      "source": "/image/smg.jpg",
      "link": "https://www.smg.bg/",
      "alternative": "Sofia High School of Mathematics (SMG) Logo",
      "isRounded": false
    }
  }
]