[
  {
    "id": "surrey",
    "heading": "University of Surrey",
    "secondaryHeading": "BSc (Hons) with Year in Industry — Oct 2018 - 2022",
    "description": "<p>I am studying <strong>BSc (Hons) Computer Science</strong> <em>second year (sandwich course)</em> in <strong>University of Surrey</strong> where I am improving and affirming my knowledge in <em>Software Engineering</em>. The third year of my course is <em>industrial placement</em>.</p><p>1st Semester: (91%)</p><ul class=\"font-italic\"><li>Programming Fundamentals (94%): the basis of software developing; object-oriented programming; Java; Unit testing with JUnit</li><li>Web and Database Systems (88%): Computer Networking: Web, URL, relative and absolute paths, HTTP requests, Cookies, Web Security, HTML, CSS, PHP, JavaScript (jQuery), data objects transmission formats - XML and JSON, Databases - MySQL</li><li>Computer Logic (87%): how a computer works at the lowest levels, logic gates, truth tables, combinational circuits, adders, latches and flip-flops, number bases, Arduino: AVR Assembly, C programming language</li><li>Foundations of Computing (93%): Set Theory, Number theory, base functions theory, Logic</li></ul><p>2nd Semester (90%):</p><ul class=\"font-italic\"><li>Software Engineering (85%): designing - UML, Software Requirements Specification, test planning; implementing and testing (unit testing and requirements testing) desktop software systems (Java, Swing - WindowBuilderPro, JUnit)</li><li>Mobile Computing (79%): operating systems basis - bootloader, terminals, multi-threading, thread pool; Android: adb and fastboot, applications - Layouts, Activities, SQLite and multi-threading (Java was used)</li><li>Data Structures and Algorithms (98%): algorithm analysis (Big O, Big Omega, Big Theta, Little o notation), recursion, sorting - Bubble, Insertion, Heap, Quick, Merge, Radix; graph algorithms and complex data structures - stacks and queues, linked lists, Binary trees, heaps</li><li>Foundations of Computing II (99%): Calculus - limits, continuity, derivatives, integration and applications</li></ul",
    "picture": {
      "width": 100,
      "source": "",
      "link": "",
      "alternative": "",
      "isRounded": false
    }
  },
  {
    "id": "sofia-high-school",
    "heading": "Sofia High School of Mathematics",
    "secondaryHeading": "High School Education — 2010 - 2018",
    "description": "<p>I studied in Sofia High School of Mathematics (SHSM) from 2010 to 2018. It is considered to be the best secondary school in Bulgaria, especially for <strong>Mathematics and Computer Science</strong>, and is the hardest one to get admitted to. The students of SHSM are globally known for their achievements not only for <em>Mathematics and Computer Science</em>, but also for <strong>natural sciences</strong> such as <em>Physics</em>, <em>Chemistry</em>, <em>Astronomy</em> etc.</p><p>My high school was the place I found my passion for creating software as there I started attending <strong>extracurricular classes for programming</strong> in the 6th grade. In these classes we used to construct simple console applications in <strong>C++</strong> in order to develop our <em>algorithmic thinking</em>. Eventually, we had 6+ hours a week <strong>Programming classes</strong>, in which we studied the basis of <em>object-oriented programming</em> and <em>high-quality code</em>.</p><p>At Sofia High School of Mathematics I obtained a Diploma za Zavarsheno Sredno Obrazovanie with an <strong>Overall Score: Excellent 5.96/6.00</strong></p><p>The scores of my <em>state matriculation exams</em> were as follows:</p><ul class=\"font-italic\"><li>Physics and Astronomy: Excellent 6.00/6.00</li><li>Mathematics: Excellent 6.00/6.00</li><li>Bulgarian Language and Literature: Excellent 5.64/6.00 (the only grade different from 6.00 in my whole diploma)</li></ul",
    "picture": {
      "width": 100,
      "source": "",
      "link": "",
      "alternative": "",
      "isRounded": false
    }
  }
]