[
  {
    "id": "technologica",
    "heading": "Technologica Ltd.",
    "secondaryHeading": "Software Engineer Intern &mdash; Jul 2019 &ndash; Sep 2019",
    "description": "<p>While working at Technologica Ltd. I was part of the .NET department of the company and worked as Software Engineer Intern. I had the opportunity to be part of the team developing the military data exchange system of the Bulgarian National Codification Bureau for NATO. My responsibility in the team was to create the core of the system, which was validating, processing, saving the messages and responding to them. The project is written using .NET (C# for the business logic, ASP.NET Core MVC for the Beck-end, Oracle for the database, Entity Framework for the connection with the database). My main accomplishments were in the business logic and working with the database.</p><p>I was also part of the team redesigning and rewriting RegIX (Registry Information eXchange system) &mdash; a web information system for data exchange between government institution in Bulgaria. My responsibilities were in the Back-end &mdash; controllers, services and repositories for the REST services used for exchanging data.</p><p>At Technologica I met many friendly people, which are still very close friends to me, and found a friendly working environment, encouraging everyone to show the best version of themselves.</p>",
    "picture": {
      "width": 190,
      "source": "media/technologica.png",
      "link": "http://www.technologica.com/",
      "alternative": "technologica.png",
      "isRounded": true
    }
  },
  {
    "id": "gamesoft",
    "heading": "Gamesoft Ltd.",
    "secondaryHeading": "Junior Software Engineer &mdash; Oct 2017 &ndash; Sep 2018",
    "description": "<p>I was working in Gamesoft Ltd. as a software engineer in order to broaden my horizons in the sphere of computer science. I gained a great deal of knowledge about the principles of Object-oriented programming and enhanced my skills as writing high-quality programming code was an essential part of my job. Moreover, I had to use unit testing almost for each fragment of code I used to wrote as it was absolutely essential if the code was to be changed in the future and used by other software engineers.</p><p>While working there my main assignment was to write classes (or functions) by previously established requirements and functionalities. For that I used primarily C#, Java or C++, whichever was needed for the specific project. This thought me how to be more flexible and adapt to what is needed by me. I also had to alter and improve websites when needed using JavaScript and HTML/CSS.</p><p>Working with databases was also part of my responsibilities while I was working in Gamesoft Ltd. I used to write queries for procedures, views, transactions and functions for the databases of our clients. When using databases in applications I used Entity Frameworks in .NET Frameworks or .NET Core. Furthermore, .NET turned out to be my most preferable programming technology for creating software.</p>",
    "picture": {
      "width": 190,
      "source": "",
      "link": "",
      "alternative": "",
      "isRounded": false
    }
  }
]